# # Становници једне дугачке улице желе да одреде положај на којем ће бити направљена антена за мобилну
# телефонију. Пошто желе да локацију одреде на најправеднији могући начин, договорили су се да антену
# саграде на месту на ком ће збир растојања свих оних који се налазе лево од антене до ње, бити једнак збиру
# растојања свих оних који се налазе десно од антене до ње. Ако су познате координате свих кућа у улици
# (можемо замислити да су то координате тачака на једној правој), напиши програм који одређује положај
# антенте.
#
# Улаз: Са стандардног улаза у првој линији се уноси природан број n (1 ≤ n ≤ 100) који представља број
# станара, а у наредних n линија реални бројеви (од −1000 до 1000) који представљају координате станара (x
# координате тачака на оси).
#
# Излаз: На стандардни излаз исписати један реалан број који представља тражени положај антене (допуштена
# је толеранција грешке 10−5
# ).
#
# Пример
# Улаз
# 5
# -7.34
# 15.6
# 3.67
# -22.17
# 6.2
# Излаз
# -0.80800

suma = 0
broj_kuca = int(input("Unesti broj kuca: "))

for i in range (broj_kuca):
    suma = suma + float(input("Unesi koordinatu kuce: "))

print("Pozicija bandere je "+(format(suma/broj_kuca,'.5f')))
