# Менаџер једног великог ланца продавница жели да зна структуру прихода. Он је зато све куповине разврстао
# у мале, средње и велике на следећи начин: ако је износ рачуна за неку куповину X, та куповина се сматра зa
# малу ако је X ≤ M, за средњу ако је M < X ≤ V , а за велику ако је V < X. Менаџер жели да за посматрани
# период зна колики је укупан приход продавница од малих, средњих и велилких куповина редом.
#
# Улаз: Са стандардног улаза се у првом реду учитавају бројеви M и V (1 ≤ M < V ≤ 100000). У другом
# реду је цео број n, укупан број куповина у свим продавницама у посматраном периоду (1 ≤ n ≤ 50). У
# трећем и последњем реду су исноси рачуна за n куповина, цели позитивни бројеви до 200000 раздвојени по
# једним размаком.
#
# Излаз: Три цела броја, сваки у посебном реду. Ови бројеви су укупни приходи од малих, средњих и великих
# куповина.
#
# Пример
# Улаз
# 100 1000
# 5
# 88 1010 512 100 2500
# Излаз
# 188
# 512
# 3510

m , v = map(int,input("Unesi vrednosti za M i V : ").split())
n = int(input("Unesti broj kupaca: "))
sum1 = 0
sum2 = 0
sum3 = 0
k = list(map(int,input("Unesi vrednost racuna: ").split()))

for i in range (n):
    if k[i] <= m :
        sum1 = sum1 + k[i]
    elif k[i] < v :
        sum2 = sum2 + k[i]
    else:
        sum3 = sum3 + k[i]

print("Vredost malih kupovina: "+str(sum1))
print("Vredost srednjih kupovina: "+str(sum2))
print("Vredost velikih kupovina: "+str(sum3))
