# За дати низ тачака у равни одредити полупречник најмањег круга, са центром у координатном почетку, који
# садржи све дате тачке.
#
# Улаз: Са стандардног улаза у првој линији се уноси природан број n (1 ≤ n ≤ 100) који представља број
# тачака у равни, а у наредних n линија у свакој линији по два реалана броја (од −1000 до 1000),
# који представљају координате x и y тачке у равни.
#
# Излаз: На стандардни излаз исписати један реалан број (допуштена је толеранција грешке 10−5) -
# полупречник најмањег круга са центром у координатном почетку, који садржи све учитане тачке.
# Пример
# Улаз
# 4
# 2.6 3.4
# 1.2 6.7
# 3.33 5.55
# 2.57 3.44
# Излаз
# 6.80661
import math


def unos_tacaka ():
    x,y = input("Unesi koordinate tacke: ").split()
    return float(x), float(y)

n = int(input("Unesi broj tacaka: "))
x , y = unos_tacaka()
xy = math.sqrt(pow(x,2)+pow(y,2))

for i in range (1, n):
    x1 , y1 = unos_tacaka()
    x1y1 = math.sqrt(pow(x1, 2) + pow(y1, 2))
    if xy < x1y1 :
        xy = x1y1

print("Poluprecnik kruga iz koordinatnog pocetka koji sadrzi sve tacke je: "+format(xy,'.5f'))
