# Написати програм којим се исписују вредности n равномерно размакнутих реалних бројева из интервала
# [a, b], тако да је прва вредност a, а последња b.
#
# Улаз: Прва линија стандардног улаза садржи природан број n (1 < n ≤ 20), друга линија садржи реалан
# број a, а трећа линија реалан број b, при чему је a < b.
#
# Излаз: На стандардном излазу приказати редом тражене бројеве, заокружене на пет децимала, сваки у посебној линији.
#
# Пример
# Улаз
# 5
# -1
# 1
# Излаз
# -1.00000
# -0.50000
# 0.00000
# 0.50000
# 1.00000

n = int(input("Uneti broj tacaka/brojeva u intervalu: "))
a = float(input("Unesi prvi broj intervala: "))
b = float(input("Unesi drugi broj intervala: "))
dx = (b - a) / (n - 1)
x = a
for i in range(n):
    print(format(x, '.5f'))
    x = x + dx
