# Власник имања, Маринко, одлучио је да гаји малине. Направио је план за n година. Прве године планира да
# произведе t тона малина, а сваке следеће да повећа производњу за p%. Написати програм којим се одређује
# колико тона малина Маринко планира да произведе n-те године узгајања малина.
#
# Улаз: Прва линија стандардног улаза садржи природан број n (n ≤ 10) број планираних година.
# Друга и трећа линија стандардног улаза садрже по један реалан број, који редом представљају колико тона малина
# Маринко планира да произведе прве године t (0 < t < 5) и за колико процената Маринко планира да повећа
# производњу сваке године p (10 ≤ p ≤ 50).

# Излаз: На стандардном излазу приказати, на две децимале,
# колико тона малина Маринко планира да произведе n-те године узгајања малина.
#
# Пример
# Улаз
# 5
# 2
# 25
# Излаз
# 4.88

god =  int(input("Unesi broj godina planiranog uzgoja malina: "))
tona = int(input("Unesi koliko tona malina je proizvedeno prve godine: "))
pro =  int(input("Unesi prosecan procenat rasta svake godine: "))


for i in range(god-1):
    tona = tona * (1+(pro/100))

print(format(tona,'.2f')+" tona za "+str(god)+" godinu")
