# Потрошачка корпа је коштала 60000 динара. Након годину дана цене су порасле 21 проценат и потрошачка
# корпа је коштала 72600 динара. Након друге године цене су порасле још 44 процента и потрошачка корпа је
# коштала 104544 динара. Поставља се питање колико је просечно годишње порасла цена потрошачке корпе.
# Дефинишимо да ће просечан проценат пораста цене бити онај који, када се примени након сваке године,
# на крају дати исту цену као и у случају полазних пораста цена. У нашем примеру, ако би цена порасла 32
# процента након годину дана потрошачка корпа би коштала 79200 динара, и ако би након друге године порасла
# још 32 процента, на крају би коштала поново тачно 104544 динара, тако да кажемо да је просечан пораст цене
# 32 процента. Напиши програм који за дате појединачне проценте пораста цене након сваке године израчунава
# просечан проценат пораста цене током целог периода.
#
# Улаз: Са стандардног улаза се уноси број n (важи 2 ≤ n ≤ 10) а затим n реалних бројева p1, p2, . . . , pn који
# представљају проценте раста цене на крају сваке године (за свако pi важи да је 5 ≤ pi ≤ 50).
#
# Излаз: На стандардни излаз приказати један реалан број заокружен на две децимале који представља просечан проценат пораста цене.
#
# Пример 1
# Улаз
# 2
# 21
# 44
# Излаз
# 32.00
#
# Пример 2
# Улаз
# 5
# 47.0
# 13.0
# 13.5
# 26.5
# 16.5
# Излаз
# 22.68

import math
n = int(input("Unesi broj godina: "))                                                   # broj godina

# učitavamo procenat rasta za svaku godinu i izračunavamo proizvod koeficijenata rasta
proizvod = 1.0

for i in range(n):
    pi = float(input("Uneti procenat rasta cena za "+str(i+1)+" godinu: "))           # procenat rasta u tekućoj godini
    proizvod = proizvod * (1.0 + pi / 100.0)

# izračunavamo i ispisujemo prosečno poskupljene
prosecno_poskupljenje = 100.0 * (math.pow(proizvod, 1.0 / n) - 1.0)
print(format(prosecno_poskupljenje, '.2f')+" % je prosecno poskupljenje")
