# На аукцији неке слике учествује n купаца. Сваки купац је понудио извесни износ новца и сви купци су
# понудили различите износе. Написати програм којим се одређује редни број купца који је понудио највећи
# износ.
#
# Улаз: Прва линија стандарног улаза садржи природан број n (1 ≤ n ≤ 1000) који представља број купаца.
# У наредних n линија налази се по један позитиван реалан број, ти бројеви представљају износе новца коју
# су понудио купци редом.
#
# Излаз: У првој линији стандарног излаза приказати редни број купца који је понудио највећи износ новца.
#
# Пример
# Улаз
# 5
# 123.23
# 234.45
# 100.23
# 345.00
# 128.80
# Излаз
# 4

def unos ():
    x = input("Unesi vrednost: ")
    return float(x)

n = int(input("Unesi broj unosa: "))

x = unos()
broj_unosa = 1

for i in range (2,n+1):
    x1 = unos()
    if x < x1 :
        x=x1
        broj_unosa = i

print("Redni broj maksimuma: "+str(broj_unosa))
