# У школи је велико интересовање за програмерску секцију, на којој ће се правити рачунарске игре.
# Наставник је поставио услов да на секцију могу да иду само они ученици који имају 5 из информатике и бар 4 из
# математике. Написати програм који одређује колико ученика може да се пријави за секцију.
#
# Улаз: у првом реду број N, број ученика заинтересованих за секцију, природан број не већи од 200. У сваком
# од следећих N редова низ оцена једног од заинтересованих ученика из свих 11 предмета редом, раздвојени
# по једним размаком. Оцена из математике је шеста, а из информатике девета у низу од 11 цифара.
#
# Излаз: На стандардни излаз исписати један цео број, број ученика који испуњавају услов.
#
# Пример 1
# Улаз
# 4
# 5 5 5 5 5 3 5 5 4 5 5
# 5 5 5 5 5 4 5 5 4 5 5
# 5 5 5 5 5 4 5 5 5 5 5
# 2 2 2 2 2 5 2 2 5 2 2
# Излаз
# 2
#
# Пример 2
# Улаз
# 2
# 5 5 5 5 5 5 5 5 4 5 5
# 5 5 5 5 5 3 5 5 5 5 5
# Излаз
# 0

n = int(input("Unesi broj zainteresovanih ucenika: "))
m = 0

for i in range (n):
    a,b,c,d,e,f,g,h,i,j,k = map(int, input("Unesi spisak ocena: ").split())
    if f>3 and i>4:
        m +=1

print("Broj ucenika koji ispunjavaju uslove za sekciju je "+str(m))
