# Чувени кошаркаш Дабло Трипловић има толико добре статистике, да се већ помало сумња да су његови успеси
# добро пребројани.
# Написати програм који одређује колико пута је Трипловић постигао такозвани трипл–дабл.
#
# Улаз: На стандардноим улазу се у првом реду налази цео број N, (1 ≤ N ≤ 100), број утакмица које је
# Трипловић одиграо у сезони. У сваком од следећих N редова по 3 цела броја раздвојена по једним размаком:
# број поена, скокова и асистенција редом (ови бројеви нису већи од 1000).
#
# Излаз: На стандардни излаз исписати један број, број утакмица на којима је Трипловић постигао трипл–
# дабл.
# Напомена
# За потребе овог задатка трипл–дабл дефинишемо као најмање двоцифрен учинак (10 или више) у све три
# категорије које се прате. Другим речима: сва три броја већа од 9 у једном реду улаза.
#
# Пример
# Улаз
# 3
# 20 9 7
# 127 12 11
# 11 14 12
# Излаз
# 2

n = int(input("Uneti broj utakmica: "))
br = 0

for i in range (n):
    x, y, z = map(int, input("Unesi broj poena, skokova i asistencija : ").split())
    if x>9 and y>9 and z>9 :
        br +=1

print("Broj tripl-double utakmica: "+str(br))
