# Професор математике је поставио следећи задатак:
# Одредити суму n бројева, ако је први број дати број a, а сваки следећи број добија се тако што претходни
# број помножимо са датим бројем q.
# Ученик који први реши задатак добија петицу. Помозите ученицима, напишите програм којим се за дати
# природан број n, и дате реалне бројеве a и q одређује тражена сума.
#
# Улаз:
# • Прва линија стандардног улаза садржи природан број n (n ≤ 50).
# • Друга линија стандардног улаза садржи реалан број a (0 < a ≤ 10).
# • Трећа линија стандардног улаза садржи реалан број q (0 < q < 1).
#
# Излаз: На стандардном излазу приказати, на пет децимала, тражену суму бројева.
#
# Пример
# Улаз
# 4
# 20.00
# 0.50
# Излаз
# 37.50000

n = int(input("Uneti koliko brojeva ucestvuje u izracunavanju sume: "))
a = float(input("Uneti prvi broj: "))
q = float(input("Uneti broj koji je mnozilac za naredne brojeve: "))

suma = a
sum = a

for i in range (n-1):
    suma = suma + sum * q
    sum = sum * q

print("Ukupna suma je :", format(suma,'.5f'))
