# Тежиште T троугла ABC је пресек његових тежишних дужи. Та тачка има и друга занимљива својства. На
# пример, када бисмо изрезали троугао од папира, могли бисмо да га балансирамо на врху оловке, само ако
# бисмо оловку поставили у тежиште троугла. Такође, тежиште је тачка таква да је збир квадрата растојања
# између ње и темена троугла (тј. израз |AT|^2 + |BT|^2 + |CT|^2) најмањи могућ. Уједно, то је једина тачка таква
# да је збир вектора AT + BT + CT = 0 . Користећи последње поменуто својство, појам тежишта се може
# уопштити на произвољан коначан скуп тачака (тада се понекад назива и барицентар или центроид).
# Напиши програм који за n тачака равни задатих својим координатама одређује њихово тежиште.
#
# Улаз: Са стандардног улаза учитава се број 3 ≤ n ≤ 100 и затим 2n парова реалних бројева (xi , yi), при
# чему је сваки број у посебном реду, који представљају координате n тачака равни.
#
# Излаз: На стандардни излаз исписати координате тежишта тог скупа тачака, прво координату x,
# затим координату y, сваку у посебном реду, заокружену на пет децимала.

# Пример
# Улаз
# 3
# 0
# 0
# 0
# 1
# 1
# 0
# Излаз
# 0.33333
# 0.33333

# broj tacaka
n = int(input("Uneti broj tacaka: "))

# zbir koordinata x i koordinata y
zbir_x = 0.0
zbir_y = 0.0

for i in range(n):
    # koordinate tekuce tacke
    x = float(input("Uneti x koordinatu: "))
    y = float(input("Uneti y koordinatu: "))

    # uvecavamo zbirove
    zbir_x = zbir_x + x
    zbir_y = zbir_y + y
    
# izracunavamo proseke
t_x = zbir_x / n
t_y = zbir_y / n

# ispisujemo rezultat
print("Tezisna tacka ima x-koordinatu "+format(t_x, '.5f')+" i y-koordinatu "+format(t_y, '.5f'))
